cases/hartmann/openfoam/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Hartmann channel: x in [0,20], y in [-1,1] (half-width a=1), z 1-cell (2D).
// Wall-normal grading clusters cells at BOTH walls (symmetric multi-grading) so
// the Hartmann layer ~ a/Ha is resolved by ~8+ cells up to Ha=50 (wall cell ~0.002).
scale   1;

vertices
(
    (0  -1 0)
    (20 -1 0)
    (20  1 0)
    (0   1 0)
    (0  -1 0.1)
    (20 -1 0.1)
    (20  1 0.1)
    (0   1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 80 1)
    simpleGrading
    (
        1
        (
            (0.5 0.5 50)      // lower half: cells shrink toward y=-1 wall (ratio 50)
            (0.5 0.5 0.02)    // upper half: cells shrink toward y=+1 wall (ratio 1/50)
        )
        1
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (2 6 5 1) );
    }
    lowerWall
    {
        type wall;
        faces ( (1 5 4 0) );
    }
    upperWall
    {
        type wall;
        faces ( (3 7 6 2) );
    }
    frontAndBack
    {
        type empty;
        faces ( (0 3 2 1) (4 5 6 7) );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
